// Написать программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 
// в 3D пространстве.

Console.Clear();
Console.WriteLine();